# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# *Пример:*

# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10

sum_bird = int(input("Enter the total number of birds (value must be a multiple of 6): ")) # Пользователь вводит значение КРАТНОЕ 6. Можно сделать защиту от дурака, но мы доверяем пользователю
print(f"Petya made {int(sum_bird/6)} birds, Katya made {(int(sum_bird/6)*4)} birds, Sergey made {int(sum_bird/6)} birds") # Выводим результат
